/* Menu action item for sharing device logs. */
"AboutPassphrases" = "About Passphrases";

/* Action item in settings screen to add an Issuer manually.
   Add credential in issuer detail
   Title in settings */
"AddCredential" = "Add Credential";

/* Title when adding certificate in progress
   Title when adding issuer in progress */
"AddingCredential" = "Adding Credential";

/* Title when adding issuer in progress */
"AddingIssuer" = "Adding Issuer";

/* Action item in settings screen to add an Issuer manually.
   Navigation title for the 'Add Issuer' form. */
"AddIssuer" = "Add Issuer";

/* Generic error when adding an issuer. */
"AddIssuerFailAlertMessage" = "Adding this issuer failed. Please try again";

/* Alert title when adding an issuer fails for any reason. */
"AddIssuerFailAlertTitle" = "Add Issuer Failed";

/* Error message displayed when adding issuer failed */
"AddIssuerFailMessage" = "There was an error adding this issuer. This can happen when a single-use invitation link is clicked more than once. Please check with the issuer and request a new invitation, if necessary.";

/* Generic error for failure to add an issuer */
"AddIssuerGenericError" = "Something went wrong adding this issuer. Try again later.";

/* Add issuer alert message */
"AddIssuerSuccess" = "An issuer was added. Please check your issuers screen.";

/* Invalid state error message when adding an issuer. */
"AppRestartRequired" = "The app is in an invalid state. Please quit the app & relaunch. Then try again.";

/* Force app update dialog message */
"AppUpdateAlertMessage" = "In order to add this issuer, you must have the latest version of Certifico Wallet.";

/* Force app update dialog title */
"AppUpdateAlertTitle" = "Please Update Certifico Wallet";

/* Confirmation before copying for backup */
"AreYouSure" = "Are You Sure?";

/* Explain that we need them to authenticate in order to replace their passphrase. */
"AuthenticateReplacePassphrase" = "Authenticate to replace your secure passphrase.";

/* Prompt to authenticate in order to reveal their passphrase. */
"AuthenticateSeePassphrase" = "Authenticate to see your secure passphrase.";

/* Auth failure replacing passphrase */
"AuthenticationError" = "Failed to authenticate. Try again.";

/* Onboarding screen backup passphrase title */
"BackupPassphrase" = "Backup Passphrase";

/* */
"BackupRestore" = "iCloud Backup & Restore";

/* Email subject line when backing up passphrase */
"BlockcertsBackup" = "Certifico Backup";

/* Title of main interface */
"BlockcertsWallet" = "Certifico Wallet";

/* Button to cancel user action
   Cancel action
   Cancel the action sheet.
   Dismiss action */
"Cancel" = "Cancel";

/* Caution title presented when attempting to delete a certificate. */
"Caution" = "Caution!";

/* Message to user to check the passphrase */
"CheckPassphraseTryAgain" = "Please check it and try again.";

/* Choose credential import method */
"ChooseMethod" = "Choose a method:";

/* Button to cancel user action */
"Close" = "Close";

/* Continue */
"Continue" = "Continue";

/* Instruction to copy and paste credential URL */
"CopyCredentialURL" = "Please type or paste the credential URL:";

/* Copy to Email or Clipboard */
"CopyEmailClipboard" = "Copy to Email or Clipboard";

/* Create backup */
"CreateBackup" = "Create Backup";

/* Credential */
"Credential" = "Credential";

/* Credential info screen field label */
"CredentialExpiration" = "Credential Expiration";

/* Successful credential import alert message */
"CredentialImportSuccess" = "This credential was successfully imported. It can be found in the issuer view.";

/* Title of credential information screen */
"CredentialInfo" = "Credential Info";

/* Credential info screen field label */
"CredentialName" = "Credential Name";

/* A longer explanation of the error message displayed when we can't read a certificate file the user tried to import. */
"CredentialParseError" = "Something went wrong when trying to open the file.";

/* Accessibility label for credential URL text field */
"CredentialURL" = "Credential URL";

/* Label for the current passphrase. */
"CurrentPassphrase" = "Current Passphrase";

/* Onboarding screen label for Current User */
"CurrentUser" = "Current User";

/* Credential info screen field label */
"DateIssued" = "Date Issued";

/* Confirm delete action */
"Delete" = "Delete";

/* Action to delete a credential in the metadata view. */
"DeleteCredential" = "Delete Credential";

/* Explanation of the effects of deleting a certificate. */
"DeleteCredentialExplanation" = "If you delete this credential and don't have a backup, you'll have to ask the issuer to send it again if you want to recover it.\n\nAre you sure you want to delete this credential?";

/* Generic error description. We couldn't delete a certificate. */
"DeleteCredentialGenericError" = "Something went wrong when deleting that certificate.";

/* Generic error title. We couldn't delete a certificate. */
"DeleteFileError" = "Couldn't delete file";

/* A message displayed after clearing the logs successfully. */
"DeleteLogsSuccess" = "Logs have been deleted from this device.";

/* Credential info screen field label */
"Description" = "Description";

/* Explanation for failing to share the log file */
"DeviceMissingLogs" = "We couldn't find the logs on the device.";

/* Button copy */
"Done" = "Done";

/* Scare tactic to warn user about insecurity of email */
"EmailBackupWarning" = "This is a low-security backup method. Do you want to continue?";

/* Action item in settings screen. */
"EmailLogs" = "Email Logs";

/* Empty Credentials View */
"EmptyCredentials" = "You will receive an email when a credential is issued. Follow the link in the email to complete the process.";

/* Specific authentication error: The user's phone has local authentication disabled, so we can't show the passphrase. */
"EnableAuthenticationPrompt" = "Please go to the Settings for Certifico Wallet and enable Touch ID, Face ID, or a passcode to secure your passphrase and try again.";

/* Enter */
"Enter" = "Enter";

/* Add Issuer Enter Code */
"EnterIssuerCode" = "Enter the one-time code";

/* Add Issuer Enter URL */
"EnterIssuerURL" = "Enter the URL provided by the issuer";

/* Enter Passphrase */
"EnterPassphrase" = "Enter Passphrase";

/* Enter Passphrase Instruction */
"EnterPassphraseInstruction" = "Please type or paste your passphrase here:";

/* Alert title when you re-import an existing certificate */
"FileAlreadyImported" = "File already imported";

/* Longer explanation about importing an existing file. */
"FileAlreadyImportedExplanation" = "You've already imported that file. Want to view it?";

/* Title for the failed-to-share-your-logs alert */
"FileNotFound" = "File not found";

/* Generic authentication failure error. */
"GenericAuthenticationError" = "Please try to authenticate again to see your passphrase.";

/* */
"iCloudExist" = "Backup already exist!";

/* */
"iCloudSavedOK" = "iCloud data saved successfully";

/* Import */
"Import" = "Import";

/* Sucessful credential import alert title */
"ImportComplete" = "Import Complete";

/* Contextual action. Tapping this prompts the user to add a file from a document provider. */
"ImportFromFile" = "Import from File";

/* Contextual action. Tapping this prompts the user for a URL to pull the certificate from. */
"ImportFromURL" = "Import from URL";

/* Credential Info Button */
"Info" = "Info";

/* Issuer info screen field label */
"IntroducedOn" = "Introduced";

/* Video Introduction*/
"VideoIntroduction" = "introduction";

/* Imported certificate didn't parse title
   Title for an alert when importing an invalid certificate */
"InvalidCredential" = "Invalid Credential";

/* Imported title didn't parse message */
"InvalidCredentialFile" = "This doesn't appear to be a valid credential URL. Please check it and try again.";

/* Title in alert view after processing failed user input */
"InvalidPassphrase" = "Invalid Passphrase";

/* This describes the issuer cell in the collection view. It's an accessibility label read aloud for users with VoiceOver. */
"Issuer" = "Issuer";

/* This error is presented when the user uses a bad nonce */
"IssuerAuthenticationError" = "We couldn't authenticate you to the issuer. Double-check your one-time code and try again.";

/* Issuer info screen field label */
"IssuerContactEmail" = "Issuer Contact Email";

/* Title of credential information screen */
"IssuerInfo" = "Issuer Info";

/* Format string for an issuer response with an invalid property. Variable is the property name that's invalid. */
"IssuerInvalidProperty" = "Issuer responded, but it contained an invalid property named \"%@\"";

/* Missing description text for issuer. */
"IssuerMissingDescription" = "No description provided.";

/* Format string for an issuer response with a missing property. Variable is the property name that's missing. */
"IssuerMissingProperty" = "Issuer responded, but didn't include the \"%@\" property";

/* Issuer info screen field label */
"IssuerName" = "Issuer Name";

/* Error message displayed when we see missing or invalid JSON in the response. */
"IssuerResponseErrorJSON" = "We couldn't understand this Issuer's response. Please contact the Issuer.";

/* Issuer View Header */
"Issuers" = "Issuers";

/* Error message when the issuer's data doesn't match the URL it's hosted at. */
"IssuerTampered" = "This issuer appears to have been tampered with. Please contact the issuer.";

/* Accessibility label for issuer URL text field */
"IssuerURL" = "Issuer URL";

/* Specific authentication error: The user's phone has local authentication disabled, so we can't show the passphrase. */
"LocalAuthenticationDisabled" = "It looks like local authentication is disabled for this app. Without it, showing your passphrase is insecure. Please enable local authentication for this app in Settings.";

/* Title for SAML login */
"LoginToIssuer" = "Log In To Issuer";

/* Manual Hard Copy */
"ManualHardCopy" = "Manual Hard Copy";

/* iCloud Backup*/
"iCloudBackup" = "iCloud Backup";

/* Error state: missing issuer data in issuer cell */
"MissingIssuer" = "Missing Issuer";

/* Multiple credentials */
"MultipleCredentials" = "You have %@ credentials";

/* Action item in settings screen. */
"MyPassphrase" = "My Passphrase";

/* Credential info screen description of credential that never expires */
"Never" = "Never";

/* Onboarding screen label for New User */
"NewUser" = "New User";

/* Welcome new user body */
"NewUserBody" = "You will receive an email when an issuer is ready to be added. Follow the link in the email to complete the process.";

/* Welcome new user footer */
"NewUserFooter" = "You may add an issuer manually by visiting Settings and tapping Add an Issuer.";

/* Welcome new user header */
"NewUserHeader" = "Ready!";

/* No credentials */
"NoCredentials" = "No Credentials";

/* Button copy
   Button label
   Button to confirm user action
   OK dismiss action */
"Okay" = "Okay";

/* 1 credential */
"OneCredential" = "1 Credential";

/* Accessibility label for issuer code text field */
"OneTimeCode" = "One-time code";

/* Navigation title for revealing the current passphrase. */
"Passphrase" = "Passphrase";

/* Passphrase description */
"PassphraseDescription" = "This is the passphrase to your wallet. There is a backup on this phone, but you must create an extra one in case you switch devices.";

/* Passphrase generated */
"PassphraseGenerated" = "Passphrase Generated!";

/* Failure saving replacement passphrase */
"PassphraseSaveFail" = "Unable to save this passphrase.";

/* Accessibility label for video play button in onboarding */
"PlayIntroVideo" = "Play intro video.";

/* Menu item in the settings screen that links to our privacy policy.
   Title for the screen with our privacy policy on it. */
"PrivacyPolicy" = "Privacy Policy";

/* Alert view title shown when unable to authenticate for My Passphrase */
"ProtectYourPassphrase" = "Protect Your Passphrase";

/* No network connection alert message */
"ReachabilityAlertMessage" = "Please check your network connection and try again.";

/* No network connection alert title */
"ReachabilityAlertTitle" = "No Network Connection";

/* Title for an error message displayed when we can't read a certificate file the user tried to import. */
"ReadFileError" = "Couldn't read file";

/* Replace passphrase action button */
"Replace" = "Replace";

/* Title for replacing the passphrase */
"ReplacePassphrase" = "Replace Passphrase";

/* Error message when an identification request is aborted */
"RequestAborted" = "The request was aborted. Please try again.";

/* Welcome returning user body */
"ReturningUserBody" = "To see your issuers, go to Settings to add your credentials or add them via the email from the Issuer.";

/* Welcome returning user footer */
"ReturningUserFooter" = "You may add an issuer manually by visiting Settings and tapping Add an Issuer.";

/* Welcome returning user header */
"ReturningUserHeader" = "Re-import Your Credentials";

/* Title for our specific warning about validating a sample certificate */
"SampleCredential" = "Sample Certificate";

/* Explanation for why you can't validate the sample certificate. */
"SampleCredentialVerificationImpossible" = "This is a sample certificate that cannot be verified. Real certificates will perform a live validation process.";

/* Select Backup Methods */
"SelectBackupMethods" = "Select Backup Methods";

/* Header for selecting backup methods */
"SelectOne" = "Please select at least one option below:";

/* Button for selecting backup methods */
"SelectOneButton" = "Select At Least One to Continue";

/* Error message when an identification request sees a server error */
"ServerError" = "The server encountered an error. Please try again.";

/* Title of the Settings screen. */
"Settings" = "Settings";

/* Credential Share Button */
"Share" = "Share";

/* Share credential action sheet title */
"ShareCredential" = "Share This Credential";

/* Alert title when sharing a certificate fails. */
"ShareCredentialError" = "Couldn't share certificate.";

/* Alert message when sharing a certificate fails. Generic error. */
"ShareCredentialGenericError" = "Something went wrong preparing that file for sharing. Try again later.";

/* Issuer info screen field label */
"SharedAddress" = "Shared Address";

/* Action to share certificate file, presented in an action sheet. */
"ShareFile" = "Share File";

/* Action to share the certificate's hosting URL, presented in an action sheet. */
"ShareLink" = "Share Link";

/* Action button for revealing the current passphrase */
"ShowPassphrase" = "Show Passphrase";

/* action completed successfully
   Add issuers alert title
   Alert title */
"Success" = "Success!";

/* Welcome returning user from app update body */
"UpdateUserBody" = "We've improved the experience, but you'll be able to receive and manage your credentials as before.";

/* Welcome returning user from app update body 2 */
"UpdateUserBody2" = "Please note that you are now required to back up your passphrase, but you can do so easily in the app.";

/* Welcome returning user from app update body 3 */
"UpdateUserBody3" = "Tap continue to begin.";

/* Welcome returning user from app update header */
"UpdateUserHeader" = "Welcome to the new Certifico Wallet!";

/* Issuer info screen field label */
"URL" = "URL";

/* Verification */
"Verification" = "Verification";

/* Credential verification fail message */
"VerificationFail" = "This credential is not verified. Please contact the issuer.";

/* Credential verification in progress message */
"VerificationInProgress" = "Verifying %@ Credential...";

/* Credential verification success message */
"VerificationSuccess" = "This is a valid %@ credential.";

/* Credential verification success */
"Verified" = "Verified!";

/* Credential Verify Button */
"Verify" = "Verify";

/* Action prompt to view the imported certificate */
"View" = "View";

/* Onboarding screen title */
"Welcome" = "Welcome";

/* Instruction to save passphrase */
"WriteYourPassphrase" = "Write your passphrase on a piece of paper and store it in a secure location.";

/* You have multiple credentials */
"YouHaveMultipleCredentials" = "You have %@ credentials";

/* You have 1 credential */
"YouHaveOneCredential" = "You have 1 credential";

"LearnMore" = "Learn more";
